Revit 2024 API
StairsType Class
 A type element containing the properties for a component-based stair.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class StairsType : ElementType
Visual Basic
Public Class StairsType _
	Inherits ElementType
Visual C++
public ref class StairsType : public ElementType
Examples
CopyC#
private void GetStairsType(Stairs stairs)
{
    StairsType stairsType = stairs.Document.GetElement(stairs.GetTypeId()) as StairsType;
    // Format stairs type info for display
    string info = "Stairs Type:  " + stairsType.Name;
    info += "\nLeft Lateral Offset:  " + stairsType.LeftLateralOffset;
    info += "\nRight Lateral Offset:  " + stairsType.RightLateralOffset;
    info += "\nMax Riser Height:  " + stairsType.MaxRiserHeight;
    info += "\nMin Run Width:  " + stairsType.MinRunWidth;
    TaskDialog.Show("Revit", info);
}
CopyVB.NET
Private Sub GetStairsType(stairs As Stairs)
    Dim stairsType As StairsType = TryCast(stairs.Document.GetElement(stairs.GetTypeId()), StairsType)
    ' Format stairs type info for display
    Dim info As String = "Stairs Type:  " + stairsType.Name
    info += vbLf & "Left Lateral Offset:  " + stairsType.LeftLateralOffset
    info += vbLf & "Right Lateral Offset:  " + stairsType.RightLateralOffset
    info += vbLf & "Max Riser Height:  " + stairsType.MaxRiserHeight
    info += vbLf & "Min Run Width:  " + stairsType.MinRunWidth
    TaskDialog.Show("Revit", info)
End Sub
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.StairsType
See Also
StairsType Members
Autodesk.Revit.DB.Architecture Namespace